<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,640,480"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,input_1:0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/model/conv2d/Conv2D/Transpose889_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="10,3,3,3" size="1080"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model/conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp/EltwiseUnsqueeze665_const" type="Const" version="opset1">
			<data element_type="f32" offset="1080" shape="1,10,1,1" size="40"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model/conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model/p_re_lu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model/p_re_lu/Neg/mul_/EltwiseUnsqueeze637_const" type="Const" version="opset1">
			<data element_type="f32" offset="1120" shape="1,10,1,1" size="40"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/p_re_lu/Neg:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model/p_re_lu/Neg_1/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu/Neg_1:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/model/p_re_lu/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu/Relu_1:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model/p_re_lu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/p_re_lu/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model/p_re_lu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/p_re_lu/add:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model/max_pooling2d/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="same_upper" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>638</dim>
					<dim>478</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/max_pooling2d/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>319</dim>
					<dim>239</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model/conv2d_1/Conv2D/Transpose893_const" type="Const" version="opset1">
			<data element_type="f32" offset="1160" shape="16,10,3,3" size="5760"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>319</dim>
					<dim>239</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_1/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp/EltwiseUnsqueeze673_const" type="Const" version="opset1">
			<data element_type="f32" offset="6920" shape="1,16,1,1" size="64"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model/conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_1/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model/p_re_lu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu_1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model/p_re_lu_1/Neg/mul_/EltwiseUnsqueeze641_const" type="Const" version="opset1">
			<data element_type="f32" offset="6984" shape="1,16,1,1" size="64"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/p_re_lu_1/Neg:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model/p_re_lu_1/Neg_1/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu_1/Neg_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model/p_re_lu_1/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu_1/Relu_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model/p_re_lu_1/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/p_re_lu_1/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model/p_re_lu_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/p_re_lu_1/add:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model/conv2d_2/Conv2D/Transpose897_const" type="Const" version="opset1">
			<data element_type="f32" offset="7048" shape="32,16,3,3" size="18432"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>317</dim>
					<dim>237</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_2/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp/EltwiseUnsqueeze669_const" type="Const" version="opset1">
			<data element_type="f32" offset="25480" shape="1,32,1,1" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model/conv2d_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_2/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model/p_re_lu_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu_2/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model/p_re_lu_2/Neg/mul_/EltwiseUnsqueeze645_const" type="Const" version="opset1">
			<data element_type="f32" offset="25608" shape="1,32,1,1" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/p_re_lu_2/Neg:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model/p_re_lu_2/Neg_1/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu_2/Neg_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/model/p_re_lu_2/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/p_re_lu_2/Relu_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model/p_re_lu_2/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/p_re_lu_2/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model/p_re_lu_2/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/p_re_lu_2/add:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model/conv2d_4/Conv2D/Transpose901_const" type="Const" version="opset1">
			<data element_type="f32" offset="25736" shape="4,32,1,1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_4/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>4</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/model/conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_4/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/model/conv2d_4/BiasAdd/ReadVariableOp/EltwiseUnsqueeze661_const" type="Const" version="opset1">
			<data element_type="f32" offset="26248" shape="1,4,1,1" size="16"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_4/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model/conv2d_4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Func/StatefulPartitionedCall/output/_14:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/model/conv2d_4/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Func/StatefulPartitionedCall/output/_14:0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</input>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model/conv2d_3/Conv2D/Transpose905_const" type="Const" version="opset1">
			<data element_type="f32" offset="26264" shape="2,32,1,1" size="256"/>
			<output>
				<port id="0" names="^StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>2</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model/conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_3/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp/EltwiseUnsqueeze677_const" type="Const" version="opset1">
			<data element_type="f32" offset="26520" shape="1,2,1,1" size="8"/>
			<output>
				<port id="0" names="^StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model/conv2d_3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_3/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/model/softmax/Softmax" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Func/StatefulPartitionedCall/output/_15:0,StatefulPartitionedCall/Identity_1:0,StatefulPartitionedCall/model/softmax/Softmax:0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Func/StatefulPartitionedCall/output/_15:0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>315</dim>
					<dim>235</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="4" from-port="2" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="6" from-port="0" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
		<edge from-layer="5" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="0" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="17" from-port="0" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
		<edge from-layer="16" from-port="1" to-layer="21" to-port="0"/>
		<edge from-layer="20" from-port="2" to-layer="21" to-port="1"/>
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1"/>
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1"/>
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="2" to-layer="28" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="1"/>
		<edge from-layer="26" from-port="1" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="2" to-layer="31" to-port="1"/>
		<edge from-layer="31" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="32" from-port="0" to-layer="33" to-port="1"/>
		<edge from-layer="33" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="34" from-port="0" to-layer="35" to-port="1"/>
		<edge from-layer="35" from-port="2" to-layer="36" to-port="0"/>
		<edge from-layer="31" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="37" from-port="0" to-layer="38" to-port="1"/>
		<edge from-layer="38" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="0" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="41" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="42" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.3.0-2787-60059f2c755-releases/2021/3"/>
		<cli_parameters>
			<data_type value="FP32"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="True"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,640,480,3]"/>
			<keep_shape_ops value="True"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="saved_model"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[  1 640 480   3]"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, move_to_preprocess, output, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
